espressif/esp-idf/examples/bluetooth/esp_ble_mesh/aligenie_demo/sdkconfig.defaults.esp32h2
# Override some defaults so BT stack is enabled
# by default in this example
CONFIG_IDF_TARGET="esp32h2"
CONFIG_BT_LE_SCAN_DUPL_TYPE_DATA_DEVICE=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_LE_50_FEATURE_SUPPORT=n

#
# light driver config
#
CONFIG_LIGHT_GPIO_RED=4
CONFIG_LIGHT_GPIO_GREEN=5
CONFIG_LIGHT_GPIO_BLUE=11
CONFIG_LIGHT_GPIO_COLD=12
CONFIG_LIGHT_GPIO_WARM=10
# end of light driver config
